Repository: 84000/data-translation-memory
Catalog: toh61-v4.tmx
Source language: bo
Languages: en

source: གཞན་ལས་བསྐྱེད་པ་མ་ཡིན་པས་ལྷས་བྱིན་ནི་དེང་ཕྱིན་ཆད་ཀྱང་གཞན་ལས་དགེ་བའི་རྩ་བ་སྐྱེད་པར་མི་བྱེད་ཀྱི། ང་འབའ་ཤིག་ལ་ཡོངས་སུ་དང་བའི་སེམས་སྐྱེད་པར་བྱེད་དོ། །སངས་རྒྱས་ལ་སྐྱབས་སུ་མཆིའོ་ཞེས་སྨྲས་པའི་དགེ་བའི་རྩ་བའི་རྒྱུ་དང་རྐྱེན་གྱིས་ན་ཕྱིས་ཀྱང་རང་སངས་རྒྱས་ཀྱི་ལམ་འཐོབ་པར་འགྱུར་བ་ཡིན་ནོ།
en: It was not thanks to others. Therefore, from now on, he will not create roots of virtue in relation to others, but instead will give rise to sincere trust toward me alone. Due to the roots of virtue created by saying, ‘I take refuge in the Buddha,’ he will later reach the path of the solitary buddhas.

source: །མཽད་གལ་ང་ནི་ཡུན་རིང་པོ་ནས་རྟག་པར་སེམས་ཅན་རྣམས་ལ་ཕ་མ་ལྟ་བུའི་འདུ་ཤེས་ཀྱིས་གང་མགོན་མེད་ཅིང་སྐྱབས་མེད་པ། རྒུད་ཅིང་ནོར་དང་མི་ལྡན་པ། འཁོར་བར་ཡང་དང་ཡང་ཁ་བརྒྱུད་ཅིང་ལམ་ངན་པར་ཞུགས་པ། གླེན་ཞིང་གཏི་མུག་པས་ཤེས་པ་མེད་པ། རྟག་པར་དམུས་ལོང་དུ་གྱུར་ཅིང་མིག་དང་མི་ལྡན་པ་དག་སུ་ཞིག་བདག་ཅག་གི་འདྲེན་པར་འགྱུར། སུ་ཞིག་མགོན་དང་སྐྱབས་བྱེད་པར་འགྱུར་སྙམ་དུ་སེམས་པ་དག་ལ་ང་གཅིག་པུས་སྙིང་བརྩེ་བས་མགོན་དང་སྐྱབས་བྱ་བར་དམ་བཅས་པས་ན། མཽད་གལ་ངས་དེ་རྗེས་སུ་དྲན་པའི་ཕྱིར་སེམས་ཅན་གང་ལ་ལ་ཞིག་ངག་རྩུབ་པོས་ང་ལ་མི་སྙན་པ་རྗོད་ཀྱང་ངས་སླར་ལན་མི་བྱེད་དོ། །ཚིག་ན་བས་ང་ལ་སྤྱོས་ཀྱང་ངས་སླར་ལན་མི་བྱེད་དོ། །
en: “Maudgalyāyana, for a long time I have constantly thought of sentient beings as my parents. I have taken the affectionate commitment to personally protect and provide refuge to those who are unprotected and defenseless, to those who are weak and destitute, to those who continuously spin in saṃsāra and follow evil paths, to those who lack insight due to their delusion and ignorance, and to those who have always been blind or do not have eyes, as well as to those who ask themselves, ‘Who will be our guide, our protector, and our refuge?’ Therefore, Maudgalyāyana, because I remember my commitment, I never answer back to someone who insults me by using harsh words, or to someone who abuses me with painful words.

source: ཁྲོས་སམ་བརྡེགས་ཀྱང་རུང་སྟེ། ནམ་ཡང་ངས་ལན་མི་བྱེད་དོ།
en: Whether someone is furious at me or beats me, I never retaliate.

source: ང་ནི་རྟག་པར་སེམས་ཅན་ཐམས་ཅད་ལ་ངེས་པའི་བདེ་བ་སྦྱིན་ཞིང་སྡུག་བསྔལ་གྱི་མི་བདེ་བ་ཐམས་ཅད་ཡོངས་སུ་བསལ་བར་བྱ་བའི་རིགས་ཀྱི། ངས་དེ་དག་ལ་གནོད་པ་རྣམས་སྦྱིན་པའི་མི་རིགས་པས་སོ།
en: Because it is sensible for me to constantly provide genuine happiness to all beings and eliminate all their suffering and unhappiness, while it is not sensible for me to harm them.

source: །སེམས་ཅན་རྣམས་ལས་སུ་ཞིག་བཟོད་པར་ནུས་པ་ཡིན་ཞེ་ན།
en: “Among all sentient beings, who is able to practice patience?

source: དེ་ནི་ང་གཅིག་པུ་ཁོ་ནས་བཟོད་པར་ནུས་པ་ཡིན་པས་ངས་དེང་སེམས་ཅན་བཟོད་པའི་ཆོས་དང་། ཤིན་ཏུ་ཉེ་བར་ཞི་བའི་ཆོས་དང་། རབ་ཏུ་དུལ་བའི་ཆོས་བསླབས་ནས་གླང་པོ་ཆེ་ཅང་ཤེས་ལྟ་བུར་དུལ་བར་བྱའི་གླང་པོ་ཆེ་མ་དུལ་བ་ལྟ་བུར་མི་བྱའོ་སྙམ་དུ་སེམས་ཏེ།
en: I am the only one able to practice patience. Therefore, I thought, ‘I will henceforth train in the Dharma of being patient with beings, the Dharma of tranquility, and the Dharma of gentleness, so that I act like a thoroughbred elephant, not like a wild elephant.’

source: མཽད་གལ་འདི་ལྟ་སྟེ་དཔེར་ན་གླང་པོ་ཆེ་ཤིན་དུ་དུལ་བ་ནི་གཡུལ་ངོར་འཇུག་པའི་ཚེ་སེམས་ལ་ནུར་བ་མེད་ཅིང་རྔ་བོ་ཆེའི་སྒྲ་དང་། དུང་གི་སྒྲ་དང་། རབ་ཏུ་འབོད་པའི་སྒྲ་དག་བཟོད་པས་འདི་ལྟ་བུའི་འཇིགས་སུ་རུང་བའི་སྒྲ་དག་ཐོས་པར་གྱུར་ན་ཡང་སྐྲག་ཅིང་འཇིགས་པ་མེད་ལ།
en: “Maudgalyāyana, take the analogy of an elephant that has been trained well. When it enters the battlefield, its mind is unshakable. It is able to bear the sounds of the great drums, the sounds of the conches, and the sounds of people screaming. Even when it hears those fearsome sounds, it does not feel any terror or fear.

source: གྲང་བ་དང་། ཚ་བ་དང་། སྦྲང་བུ་མཆུ་རིངས་དང་། ཤ་སྦྲང་གདུག་པ་ཟ་བ་དང་། རླུང་དང་། ཆར་པ་དང་། བཀྲེས་པ་དང་། སྐོམ་པ་དག་ཀྱང་བཟོད་པར་ནུས། རལ་གྲི་ཤིན་དུ་རྣོན་པོ་སྣ་ཚོགས་བཏབ་པ་དང་། མདའ་དང་། མདུང་དང་། མདུང་ཐུང་དང་། ལྕགས་ཀྱི་འཁོར་ལོ་འཕངས་པ་དང་། ལྕག་གིས་གཞུས་པ་དག་ཀྱང་བཟོད་ཅིང་སྐྲག་པ་དང་འཇིགས་པ་མེད་པར་ཐད་ཀར་གཡུལ་ངོར་མཆོང་ཞིང་ནུར་བ་དང་། འགོང་བ་མེད་པས།
en: It is able to withstand cold, heat, mosquitoes, horseflies, wind, rain, hunger, and thirst, as well as the injuries caused by the various kinds of sharp swords, arrows, spears, and javelins, as well as the iron chains that are thrown at it and the whips that strike it. Without feeling any terror or fear, it jumps directly onto the battlefield, courageously and without any wavering.

source: མཽད་གལ་གླང་པོ་ཆེ་ཤིན་དུ་དུལ་བ་ནི་འདི་སྙམ་དུ་བདག་དགྲའི་གཡུལ་དུ་འཇུག་པར་མི་བྱའོ་སྙམ་དུ་མི་སེམས་ཀྱི། བདག་དགྲའི་གཡུལ་འདི་ལས་རྒྱལ་བར་བྱའོ་སྙམ་དུ་སེམས་པ་ཁོ་ནར་ཟད་དོ།
en: Maudgalyāyana, such a well-trained elephant never thinks, ‘I should not engage with the opposing army.’ Instead, it solely thinks, ‘I will defeat the army of the enemy!’

source: །མཽད་གལ་དེ་བཞིན་དུ་ང་ཡང་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཚེ་སེམས་ཀྱིས་སྨོན་ལམ་རྒྱ་ཆེན་པོ་བཏབ་ནས་སེམས་ཅན་རྣམས་ལ་སེམས་དུལ་བར་བྱེད་པས། གལ་ཏེ་སེམས་ཅན་རྣམས་ཀྱིས་ངག་རྩུབ་པོས་ང་ལ་མི་སྙན་པ་རྗོད་ན་ཡང་ངས་ལན་དུ་གནོད་པ་མི་བྱེད་དོ།
en: “Maudgalyāyana, similarly, when I was practicing bodhisattva conduct in the past I formed a vast aspiration prayer, based on which I worked to tame my mind with respect to sentient beings. Even if someone insulted me with harsh words, I never harmed that person in return.

source: །ང་དང་རྩོད་པར་བྱེད་ན་ཡང་ངས་ལན་མི་བྱེད་དོ།
en: Even if someone argued with me, I never answered back.

source: །གལ་ཏེ་མཚོན་ཆ་དང་། དབྱུག་པ་དང་། གྱོ་མོ་དང་། རྡོ་དག་གིས་ང་ལ་གནོད་པ་བྱས་ནས་ངའི་སྲོག་འཕྲོག་པར་བྱེད་ན་ཡང་དེའི་ཚེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ནུར་བར་འགྱུར་བ་ཡང་མེད་ལ།
en: Even when others harmed me with weapons, sticks, rocks, or stones, and thereby took my life, I never wavered from unsurpassed and perfect awakening.

source: འདི་ནི་དང་དུ་བླང་བའི་རིགས་སོ། །འདི་ནི་དང་དུ་བླང་བའི་མི་རིགས་སོ། །འདི་ན་བསྟེན་པར་བྱ་བའི་རིགས་སོ། །འདི་ནི་བསྟེན་པར་བྱ་བའི་མི་རིགས་སོ་ཞེས་རྣམ་པར་རྟོག་པར་ཡང་མི་བྱེད་པས་དངོས་པོ་དེ་ལ་མྱ་ངན་དང་། འགྱོད་པ་ཡང་མེད། ཁོང་ཁྲོ་བ་དང་འཁོན་དུ་འཛིན་པ་ཡང་མེད།
en: I never thought, ‘This is something to adopt,’ ‘This is not something to adopt,’ ‘This is something that should be relied upon,’ or ‘This is not something that should be relied upon.’ Therefore, I never felt sorrow, regret, aggression, or resentment with respect to those situations.

source: བྱང་ཆུབ་སེམས་དཔའི་ལམ་ལ་ཡོངས་སུ་སྐྱོ་བ་ཡང་མེད་པས་འདི་སྙམ་དུ་དེང་བདག་དགྲའི་གཡུལ་འདིར་འཇུག་པར་མི་བྱའོ་སྙམ་དུ་མི་སེམས་ཀྱི། བདག་གིས་སྡིག་པའི་དགྲའི་གཡུལ་ཡང་དག་པར་བཅོམ་སྟེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་འཐོབ་པར་བྱས་ནས་ཁམས་གསུམ་གྱི་སེམས་ཅན་ཚད་མེད་པ་རྣམས་ཡོངས་སུ་བཟླ་བར་བྱའོ་སྙམ་དུ་སེམས་པ་ཁོ་ནར་ཟད་དོ། །མཽད་གལ་ང་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཚེ་བཟོད་པ་ཇི་སྙེད་པ་སྤྱད་པ་དང་། སེམས་ཅན་རྣམས་ལ་བྱམས་པ་དང་། སྙིང་རྗེ་ཇི་སྙེད་བསྐྱེད་པ་གལ་ཏེ་ཚིག་གིས་བརྗོད་པར་གྱུར་ན་ནམས་ཀྱང་མཐར་ཐུག་པར་མི་འགྱུར་རོ།
en: I never became weary about the bodhisattva path, and so I never thought, ‘Now I will no longer engage with the army of the enemy.’ Instead, I solely thought, ‘I will completely defeat the army of the enemy—negative actions—and once I attain unsurpassed and perfect awakening, I will liberate all the countless sentient beings of the three realms.’ Maudgalyāyana, even if I tried to express in words all the instances in which I practiced patience and gave rise to love and compassion toward sentient beings during the time when I was practicing bodhisattva conduct in the past, this task would never come to an end.

source: །གཞན་ཡང་མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་མུ་སྟེགས་ཅན་གྱི་དྲང་སྲོང་བཟོད་པའི་སྟོབས་ཞེས་བྱ་བ་ཞིག་བྱུང་སྟེ། དེས་བདག་གིས་སེམས་ཅན་ལ་ཞེ་སྡང་མི་བསྐྱེད་དོ་སྙམ་པའི་ཆོས་ཡང་དག་པར་བླངས་སོ།
en: “Furthermore, Maudgalyāyana, in the past, there was a non-Buddhist sage called Kṣāntibala who had vowed to never become angry at others.

source: །དེའི་ཚེ་སྡིག་པའི་ཡིད་ཅེས་བྱ་བའི་བདུད་ཞིག་ཡོད་དེ། དེ་འདི་སྙམ་དུ་བདག་དེང་ཅིའི་ཕྱིར་དྲང་སྲོང་དེའི་དྲུང་དུ་སོང་ནས་བཟོད་པའི་ཆོས་བཤིག་སྟེ།
en: At that time, there lived a demon called Evil Mind who thought, ‘I will go see this sage and destroy his practice of patience!

source: ཁོང་ཁྲོ་བ་བསྐྱེད་ནས་བཟོད་པ་དང་དུ་ལེན་པའི་བསམ་པ་ལས་ལྡོག་པར་བྱ་སྙམ་དུ་བསམས་ནས། དེ་ནས་སྤྱོ་བ་ལ་མཁས་པའི་མི་སྟོང་བཀྱེ་ནས་དེ་ཡོངས་སུ་བསྐོར་ཏེ་ངག་རྩུབ་པོས་སྤྱོས་ནས་མི་བདེན་པར་སྐྱོན་ནས་སྨོས། དབྱུང་བར་མི་འོས་པའི་ཚིག་ངན་པ་ན་བ་སྣ་ཚོགས་ཀྱིས་སྤྱོས་ཏེ།
en: I will make him angry, so that he turns away from his resolve to earnestly cultivate patience.’ He then sent out a thousand men who were skilled in abusing others. They surrounded the sage and started to insult him and accuse him falsely. They abused him with various types of insults that do not bear repeating.

source: འགྲོ་བའི་ཚེ་ཡང་ཚིག་གིས་སྤྱོས། གྲོང་ཁྱེར་དུ་ཕྱིན་པའི་ཚེ་ཡང་སྤྱོས། གྲོང་ཁྱེར་དུ་འཇུག་པའི་ཚེ་ཡང་སྤྱོས། ཟན་ཟ་བའི་ཚེ་ཡང་སྤྱོས། ཟ་ན་ཟོས་ཟིན་པའི་འོག་ཏུ་ཡང་སྤྱོས། སྟན་ལས་ལངས་པའི་ཚེ་ཡང་སྤྱོས། གྲོང་ཁྱེར་ནས་འབྱུང་བའི་ཚེ་ཡང་སྤྱོས། རང་གི་གནས་ནགས་ཚལ་དག་ཏུ་ཕྱིན་པའི་ཚེ་ཡང་སྤྱོས། འགྲེང་པའི་ཚེ་ཡང་སྤྱོས། འདུག་པའི་ཚེ་ཡང་སྤྱོས། ཉལ་བའི་ཚེ་ཡང་སྤྱོས། འཆག་པའི་ཚེ་ཡང་སྤྱོས། ཐ་ན་དབུགས་རྔུབ་པ་དང་དབུགས་འབྱུང་བའི་ཚེ་ཡང་སྤྱོས་ཏེ། རྟག་པར་རྗེས་སུ་འབྲངས་ནས་ཚིག་ངན་པ་སྣ་ཚོགས་ཀྱིས་རྒྱུན་ཆད་པ་མེད་པར་སྤྱོས་སོ། །
en: They abused him when he was moving, when he traveled to cities, when he entered the cities, when he ate, after he had his meal, when he got up from his seat, when he left the cities, when he came back to his hermitage in the forest, while he was standing up, while he was sitting down, while he was lying down, while he was walking, and even when he was simply breathing. They followed him at all times, continuously abusing him with all types of insults.

source: དེའི་ཚེ་མི་སྟོང་པོ་དེ་དག་བདུད་ཀྱིས་མངགས་པས་ལོ་བརྒྱད་ཁྲི་བཞི་སྟོང་གི་བར་དུ་ངག་རྩུབ་པོས་དྲང་སྲོང་བཟོད་པའི་སྟོབས་ལ་སྤྱོས་སོ།
en: For eighty-four thousand years, those thousand men sent by the demon abused the sage Kṣāntibala with harsh words.

source: །དེ་ནས་བདུད་སྡིག་པའི་ཡིད་ཀྱིས་དྲང་སྲོང་བཟོད་པའི་སྟོབས་གྲོང་ཁྱེར་དུ་འཇུག་པའི་ཚེ་བདག་ཉིད་ཀྱི་གཅིན་གྱིས་དེའི་མགོའི་སྟེང་དུ་བླུགས། ལྷུང་བཟེད་ཀྱི་ནང་དུ་བླུགས། ཆོས་གོས་དང་ལྷུང་བཟེད་ལ་ཡང་བསྐུས། ལུས་ལ་ཡང་བསྐུས། ཕྱག་དར་གྱིས་མགོ་ལ་ཡང་གཏོར་ཏོ།
en: “When the sage Kṣāntibala entered cities, the demon Evil Mind would urinate on his head and inside his alms bowl, thus soaking the sage’s robes, alms bowl, and body with his urine. He would also spread garbage on his head.

source: །དེའི་ཚེ་དྲང་སྲོང་བཟོད་པའི་སྟོབས་ལོ་བརྒྱད་ཁྲི་བཞི་སྟོང་གི་བར་དུ་སྤྱོ་བ་ལ་དཔའ་བའི་མི་སྟོང་གིས་ངག་རྩུབ་པོས་སྤྱོས་ཤིང་སྨད་པར་གྱུར་ཀྱང་དེའི་སེམས་ལ་ཞེ་སྡང་དང་འཁོན་དུ་འཛིན་པ་ཡང་མེད་ལ་ཐ་ན་སེམས་ལ་ནུར་ཞིང་ཞུམ་པར་གྱུར་པ་ཡང་མེད་དོ།
en: Still, although those thousand obstinate men abused and slandered the sage with harsh words for eighty-four thousand years, he never gave rise to anger or resentment toward them, and his mind never became even a little bit shaken or discouraged.

source: །བདག་ཉིད་ཀྱང་འདི་སྐད་དུ་བདག་གིས་ཉེས་པ་ཅི་བྱས་ཞེས་ཀྱང་མི་ཟེར་ལ་འཁོན་དུ་འཛིན་པ་ཡང་མེད་དོ།
en: He also never asked, ‘What did I do wrong?’ and he never felt any resentment.

source: །ལོ་བརྒྱད་ཁྲི་བཞི་སྟོང་གི་བར་དུ་སྡང་མིག་གིས་བདུད་སྡིག་པའི་ཡིད་ལ་བལྟས་པ་ཡང་མེད་ལ་བདག་ལ་ཉེས་པ་ཅི་ཡོད་ཅེས་སྨྲས་པ་ཡང་མེད་དོ།
en: For eighty-four thousand years, he never even looked at the demon Evil Mind with an angry glance, nor did he ever ask him, ‘What faults do I have?’

source: །མཽད་གལ་སྤྱོ་བ་ལ་དཔའ་བའི་མི་སྟོང་པོ་དེ་དག་གིས་དྲང་སྲོང་བཟོད་པའི་སྟོབས་ལ་ལོ་བརྒྱད་ཁྲི་བཞི་སྟོང་ལས་འདས་པའི་བར་དུ་སྤྱོས་ཀྱང་གཞིག་མི་ནུས་པར་རིག་ནས་ཤིན་དུ་དང་བའི་བསམ་པ་བསྐྱེད་དེ་ཁ་ན་མ་ཐོ་བ་རྣམས་ཀྱང་བཤགས་ནས།
en: “Maudgalyāyana, even though those one thousand obstinate men abused the sage Kṣāntibala for more than eighty-four thousand years, they were never able to destroy his practice. When they realized this, they began to admire him greatly, and so they confessed their wrongdoings.

source: འདི་སྐད་དུ་ཁྱོད་ཀྱིས་དངོས་པོ་འདིས་ཆོས་ཇི་ལྟ་བུ་ཞིག་ཡོངས་སུ་ཚོལ།
en: They asked the sage, ‘What kind of Dharma are you pursuing through this practice?

source: བདག་ཅག་ཀྱང་ཆོས་དེ་ཐོབ་པར་འཚལ་ལོ་ཞེས་སྨྲས་སོ། །མཽད་གལ་སྤྱོ་བ་ལ་དཔའ་བའི་མི་སྟོང་པོ་དེ་དག་དྲང་སྲོང་ལ་ཤིན་དུ་དང་བ་ཐོབ་པས་གུས་པའི་སེམས་ཀྱིས་མཆོད་ཅིང་རིམ་གྲོ་བྱས། བླ་མར་བྱས་ཤིང་བསྔགས་པ་བརྗོད་པར་གྱུར་ཏོ།
en: We also want to obtain such a Dharma!’ Because those one thousand obstinate men who had been abusing the sage had now developed strong admiration toward him, they started to respectfully worship him, venerate him, honor him, and praise him.

source: །དྲང་སྲོང་ཡང་དེ་དག་གིས་རིམ་གྲོ་དང་བསྙེན་བཀུར་བྱས་པ་ཉམས་སུ་བླངས་ཀྱང་སེམས་ལ་མངོན་པར་ཞེན་ཅིང་ཆགས་པ་ཅི་ཡང་མེད་པར་གྱུར་ཏོ།
en: However, even though the sage was honored and respected by those men, he never developed any form of clinging or attachment.

source: །མཽད་གལ་ཁྱོད་ཀྱིས་དེའི་ཚེ་དེའི་དུས་ན་དྲང་སྲོང་བཟོད་པའི་སྟོབས་ཞེས་བྱ་བ་དེ་གཞན་ཞིག་ཡིན་པ་སྙམ་དུ་སེམས་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ། དེ་ནི་ང་ཉིད་ཡིན་ནོ།
en: “Maudgalyāyana, I was that sage Kṣāntibala. Do not think that this was someone else.

source: །ངས་དེའི་ཚེ་བཟོད་པའི་ཆོས་དེ་ལྟ་བུ་ཡང་དག་པར་བླངས་པས་བདུད་སྡིག་པའི་ཡིད་ཀྱིས་མི་སྟོང་བཀྱེ་སྟེ་རྒྱུན་འཆད་པ་མེད་པར་ངག་རྩུབ་པོས་སྤྱོས་ཤིང་རྟག་པར་ང་ལ་སྨད་པར་གྱུར་ཀྱང་ངའི་སེམས་ལ་གཡོ་ཞིང་གྱུར་པ་ཅི་ཡང་མེད་དོ།
en: Because I had genuinely adopted the practice of patience at that time, my mind was never shaken and it never wavered, even though I was continuously abused and slandered with harsh words by the thousand men who had been sent by the demon Evil Mind.

source: །མཽད་གལ་སྤྱོ་བ་ལ་དཔའ་བའི་སྐྱེས་བུ་སྟོང་པོ་དེ་དག་དྲང་སྲོང་བཟོད་པའི་སྟོབས་ལ་ཤིན་དུ་དང་བ་སྐྱེས་ཏེ་སྡིག་པ་བཤགས་ནས་དྲང་སྲོང་བཟོད་པའི་སྟོབས་ཀྱི་རྗེས་སུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པས་དེའི་ཚེ་ངས་ཡོངས་སུ་བཏུལ་ནས་སངས་རྒྱས་ཀྱི་བསྟན་པ་ལ་ཡང་དག་པར་བཀོད་དེ།
en: Maudgalyāyana, those thousand obstinate men gave rise to a strong sense of admiration toward the sage Kṣāntibala. Then they confessed their negative actions and, following in the footsteps of the sage Kṣāntibala, they gave rise to the mind set on unsurpassed and perfect awakening. Thus I tamed them and established them in the teaching of the Buddha.

source: སྐྱེས་བུ་སྟོང་པོ་དེ་དག་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཕུན་སུམ་ཚོགས་པར་སྤྱད་པས་མཐར་གྱིས་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ཐམས་ཅད་ལྷག་མ་མེད་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་གྱུར་ཏོ།
en: By practicing the six perfections in an excellent manner, all those thousand beings gradually became perfect buddhas and passed into the realm of nirvāṇa without any remainder.

source: །མཽད་གལ་ཁྱོད་ཀྱིས་དེའི་ཚེ་དེའི་དུས་ན་བདུད་སྡིག་པའི་ཡིད་ཀྱིས་སྐྱེས་བུ་སྟོང་བཀྱེ་ནས་ང་ལ་སྤྱོར་བཅུག་པ་དེ་གཞན་ཞིག་ཡིན་སྙམ་དུ་སེམས་ན་དེ་ལྟར་མི་བལྟ་སྟེ། དེ་ནི་ལྷས་བྱིན་འདི་ཉིད་ཡིན་ནོ།། །།
en: Maudgalyāyana, the demon Evil Mind, who at that time sent those one thousand men to abuse me, was Devadatta. Do not think that this was someone else.

source: གཞན་ཡང་མཽད་གལ་ངས་མངོན་པར་དྲན་ཏེ། སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་ངས་རང་གི་ལུས་སེམས་ཅན་རྣམས་ལ་ཡོངས་སུ་བཏང་ནས་འཇིག་རྟེན་གྱི་སྐྱེ་བོ་རྣམས་ཀྱི་བྲན་དང་གཡོག་བྱས་པས་དེའི་ཚེ་སྐྱེ་བོ་མང་པོ་དེ་དག་གིས་ང་ལས་རྣམ་པ་སྣ་ཚོགས་བྱེད་དུ་བཅུག་སྟེ།
en: “Furthermore, Maudgalyāyana, I remember that in the past I once gave away my body to others and acted as a slave and a servant for worldly beings. During that time, those worldly beings made me do various kinds of tasks.

source: ཁ་ཅིག་གིས་ནི་ང་བཤང་གཅི་འདོར་དུ་བཅུག་གོ །ཁ་ཅིག་གིས་ནི་ང་ལུད་འདོར་དུ་བཅུག་གོ །ཁ་ཅིག་ནི་ངས་འདོར་དུ་བཅུག་གོ །ཁ་ཅིག་གིས་ནི་ང་རྩྭ་ལེན་དུ་བཏང་ངོ་།
en: Some made me remove excrement and urine. Some made me sweep off manure. Some made me sweep off soil; some sent me to pick up grass;

source: །ཁ་ཅིག་གིས་ནི་ང་འབྲུ་དང་། འོ་མ་དང་། ཞོ་དང་། མར་དང་། འབྲུ་མར་དང་། སྦྲང་རྩི་ལེན་ཏུ་བཏང་ངོ་།
en: and some dispatched me to bring grains, milk, curd, butter, oil, or honey.

source: །ཁ་ཅིག་གིས་ནི་ང་ཤིང་དང་། སོལ་བ་དང་། མེ་དང་། ཆུ་ལེན་དུ་བཅུག་སྟེ།
en: Some made me collect wood, charcoal, fire, or water.

source: འདི་ལྟ་བུ་ལ་སོགས་པའི་ལས་རྣམ་པ་སྣ་ཚོགས་བྱེད་དུ་བཅུག་ཀྱང་། མཽད་གལ་ངས་དེའི་ཚེ་གང་གིས་ང་བཤང་གཅི་འདོར་དུ་བཅུག་པ་དེའི་རྗེས་སུ་མི་བྱའོ་སྙམ་པའི་སེམས་བསྐྱེད་པ་མི་དྲན་ནོ། །གང་གིས་ང་མེ་ཏོག་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་སྤོས་དང་། སྤོས་ཀྱི་ཕྱེ་མ་དང་། བཟའ་བ་དང་། བཏུང་བ་དང་། འབྲས་བུ་ལེན་དུ་བཏང་བ་ལས་དེའི་རྗེས་སུ་མ་སོང་བ་མི་དྲན་ནོ། །མཽད་གལ་གང་གིས་ལེགས་པར་བྱེད་དུ་བཅུག་པའི་རྗེས་སུ་ནི་འགྲོ་བར་བྱ། ལེགས་པ་མ་ཡིན་པ་བྱེད་དུ་བཅུག་པའི་རྗེས་སུ་ནི་འགྲོ་བར་མི་བྱའོ་སྙམ་དུ་སེམས་བསྐྱེད་པ་ངས་ཡང་དག་པར་རྗེས་སུ་མི་དྲན་ནོ། །མཽད་གལ་ངས་དེའི་ཚེ་རྒྱལ་རིགས་ཀྱི་རྗེས་སུ་ནི་འབྲང་བར་བྱ། བྲམ་ཟེའི་རྗེས་སུ་ནི་འབྲང་བར་མི་བྱ། བྲམ་ཟེའི་རྗེས་སུ་ནི་འབྲང་བར་བྱ། རྒྱལ་རིགས་ཀྱི་རྗེས་སུ་ནི་འབྲང་བར་མི་བྱ། དམངས་རིགས་ཀྱི་རྗེས་སུ་ནི་འབྲང་བར་བྱ། གདོལ་པའི་རྗེས་སུ་ནི་འབྲང་བར་མི་བྱ། གདོལ་བའི་རྗེས་སུ་ནི་འབྲང་བར་བྱ། དམངས་རིགས་ཀྱི་རྗེས་སུ་ནི་འབྲང་བར་མི་བྱ། རྒྱལ་རིགས་དང་། བྲམ་ཟེའི་རིགས་ཀྱི་རྗེས་སུ་ནི་འབྲང་བར་བྱ། དམངས་རིགས་དང་། གདོལ་པའི་རྗེས་སུ་ནི་འབྲང་བར་མི་བྱའོ་སྙམ་དུ་སེམས་བསྐྱེད་པ་ཡང་མི་དྲན་ལ། གང་ཟག་འདི་ནི་ཆེའོ། །གང་ཟག་འདི་ནི་ཆུང་ངོ་ཞེས་དེ་དག་གི་ཁྱད་པར་དང་། གང་ཟག་འདིའི་རྗེས་སུ་ནི་འབྲང་བར་བྱ། གང་ཟག་འདིའི་རྗེས་སུ་ནི་འབྲང་བར་མི་བྱའོ་སྙམ་དུ་སེམས་པ་ཡང་མེད་ཀྱི། མཽད་གལ་གང་གིས་ད་སྔར་བོས་པའི་རྗེས་སུ་དགའ་བའི་སེམས་ཀྱིས་འགྲོ་བ་ཁོ་ནར་ཟད་དོ། །
en: Maudgalyāyana, although they made me do all those various tasks, I do not remember ever having thought, ‘I will not follow those orders to sweep off excrement and urine.’ I do not remember ever having refused them when they sent me to collect flowers, perfumes, garlands, fragrant ointments, fragrant powders, food, drinks, or fruits. Maudgalyāyana, I do not remember ever having thought, ‘I will only follow the orders of those who make me do something pleasant, and not the orders of those who ask me to do something unpleasant.’ Maudgalyāyana, I do not remember ever having thought, ‘I will follow the orders of those who belong to the warrior class, but not those of the brahmins,’ ‘I will follow the orders of the brahmins, but not the orders of those who belong to the warrior class,’ ‘I will follow the orders of those who belong to the commoner class, but not those of the outcastes,’ ‘I will follow the orders of the outcastes, but not the orders of those who belong to the commoner class,’ or ‘I will follow the orders of those who belong to the warrior class and the brahmins, but not the orders of those who belong to the commoner class and the outcastes.’ I never discriminated between people by thinking, ‘This person is greater,’ or ‘This person is inferior,’ and I never thought, ‘I will follow this person but not that one.’ Maudgalyāyana, I always joyfully followed the orders of anyone who called on me.

source: མཽད་གལ་ངས་མངོན་པར་དྲན་ཏེ། ང་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཚེ་གང་གིས་ཆོས་བཞིན་གྱི་བྱ་བ་དག་ང་བྱེད་དུ་བཅུག་པ་ལས་ནུས་བཞིན་དུ་མ་བྱས་པ་ཡོད་པར་ནམ་ཡང་མི་དྲན་ནོ།
en: “Maudgalyāyana, I do not remember that in the past, when I was practicing bodhisattva conduct, I ever refused to do something that anyone asked of me, as long as this task was in harmony with the Dharma and I was able to do it.

source: །མཽད་གལ་ངས་མངོན་པར་དྲན་ཏེ། ང་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཚེ་བྱ་བའི་དངོས་པོ་དག་ངེས་པར་མཐར་མ་ཕྱིན་པའམ། དགེ་བའི་ལས་མངོན་པར་འདུ་བྱ་བའི་དགེ་བ་གང་ཡང་མཐར་མ་ཕྱིན་པ་ཡོད་པ་རྗེས་སུ་མི་དྲན་ནོ།
en: Maudgalyāyana, I do not remember that in the past, when I was practicing bodhisattva conduct, I ever failed to complete a task or perfect a virtuous action.

source: །མདོར་ན་ངས་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཚེ་ནམ་ཡང་ལུས་ལ་མངོན་པར་ཞེན་པར་གྱུར་པ་ཡང་མེད་ན་ནོར་གྱི་དངོས་པོ་ལ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས།
en: In short, when I was practicing bodhisattva conduct in the past, I never developed clinging to my body, let alone to wealth.

source: ང་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཚེ་ལོངས་སྤྱོད་ཀྱི་དངོས་པོ་དག་ལ་འདི་ནི་བདག་གི་ལོངས་སྤྱོད་ཡིན་ནོ་སྙམ་པའི་འདུ་ཤེས་བསྐྱེད་པ་མེད་ཀྱང་སྔོན་གྱི་ལས་ཀྱི་རྣམ་པར་སྨིན་པའི་དབང་གིས་ལོངས་སྤྱོད་དང་ལྡན་པར་གྱུར་པར་ཟད་པས་ལོངས་སྤྱོད་ཀྱི་དངོས་པོ་དག་ལ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: When I was practicing bodhisattva conduct in the past, I never thought of material wealth as my possession. Nevertheless, I simply became wealthy through the ripening of my previous actions.

source: དངོས་པོ་འདི་དག་ནི་སེམས་ཅན་རྣམས་དང་ཐུན་མོང་དུ་ལོངས་སྤྱོད་པར་བྱ་སྟེ།
en: I thought, ‘These things should be equally enjoyed by all beings.

source: དངོས་པོ་འདི་ལ་བདག་གི་སྐལ་བ་ཡོད་པ་བཞིན་དུ་སེམས་ཅན་རྣམས་ལ་ཡང་སྐལ་བ་ཡོད་དོ་སྙམ་དུ་སེམས་སོ། །མཽད་གལ་ངས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་དབང་གིས་སངས་རྒྱས་ཀྱི་ཆོས་དང་ཉེ་བར་གྱུར་ཀྱང་། བདག་གི་ལོངས་སྤྱོད་ལ་བདག་ཀྱང་སྐལ་བ་ཡོད། སེམས་ཅན་ཡང་སྐལ་བ་ཡོད་དོ་སྙམ་དུ་མི་སེམས་ཀྱི། ལོངས་སྤྱོད་འདི་དག་ནི་སེམས་ཅན་རྣམས་ཀྱི་ཡིན་པས་བདག་ལ་སྐལ་བ་ཅི་ཡང་མེད་དོ་སྙམ་དུ་སེམས་པ་ཁོ་ནར་ཟད་དོ།
en: Everyone deserves to enjoy this wealth just as much as I do.’ Maudgalyāyana, then, as I became more familiar with the Dharma of the Buddha through my practice of bodhisattva conduct, I even stopped thinking, ‘I deserve this wealth and so do others.’ Instead, I solely thought, ‘Others deserve to have this wealth, not me.’

source: །མཽད་གལ་ངས་སངས་རྒྱས་ཀྱི་ཆོས་དང་ཉེ་བར་གྱུར་པ་རྗེས་སུ་ཐོབ་པར་གྱུར་ཀྱང་དེ་ལ་མངོན་པར་ཞེན་པ་ཡང་མེད།
en: “Maudgalyāyana, although I had become familiar with the Dharma of the Buddha, I never developed clinging to it.

source: ཡོངས་སུ་སྡུད་ཅིང་ལེན་པར་ཡང་མི་བྱེད་པས་ཆོས་རྣམས་ཡོངས་སུ་སྤོང་བ་ལ་མོས་པར་བྱེད་ཀྱི། ཆོས་རྣམས་དང་དུ་ལེན་པ་ལ་མོས་པར་མི་བྱེད་དོ།
en: Without collecting or holding on to it, I was inspired by abandoning phenomena, not to eagerly take them up.

source: །སྟོང་པའི་ཆོས་ཐམས་ཅད་ལ་མོས་པར་བྱེད་ཀྱི། ཡོད་པའི་ཆོས་ཐམས་ཅད་ལ་མོས་པར་མི་བྱེད་དོ།
en: I was inspired by all phenomena being empty, not by all phenomena existing.

source: །ཉེ་བར་ཞི་བའི་ཆོས་ཐམས་ཅད་ལ་མོས་པར་བྱེད་ཀྱི། ཆོས་རྣམས་ཀྱི་དངོས་པོའི་མཚན་ཉིད་ལ་མོས་པར་མི་བྱེད་དོ།
en: I was inspired by being at peace from all phenomena, not by the substantial characteristics of phenomena.

source: །གཟོད་མ་ནས་མེད་པ་ཉིད་ལ་མོས་པར་བྱེད་ཀྱི། བཟོད་མ་ནས་ཡོད་པ་ཉིད་ལ་མོས་པར་མི་བྱེད་དོ། །
en: I was inspired by primordial nonexistence, not by primordial existence.

source: མཽད་གལ་ངས་མངོན་པར་དྲན་ཏེ། ངས་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཚེ་ཚེ་རབས་བརྒྱ་སྟོང་ཚད་མེད་པ་སྙེད་དུ་མཚན་མོ་མུན་པའི་ནང་ན་རང་གི་ལུས་ལ་མེས་སྦར་ནས་ལམ་སྟོར་བའི་སེམས་ཅན་རྣམས་སྣང་བར་བྱས་ཏེ་ལམ་བསྟན་ཏོ།
en: “Maudgalyāyana, I clearly remember that in the past, when I was practicing bodhisattva conduct, in countless hundreds of thousands of lifetimes I would set my body on fire during dark nights, to guide sentient beings who had lost their way and to illuminate their paths.

source: མཽད་གལ་ངས་མངོན་པར་དྲན་ཏེ། ངས་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཚེ་ཚེ་རབས་བརྒྱ་སྟོང་ཚད་མེད་པ་སྙེད་དུ་ཤ་ཟ་བའི་སེམས་ཅན་རྣམས་ལ་རང་གི་ཤ་བཅད་ནས་སྦྱིན་པ་ཡོངས་སུ་བཏང་ངོ་།
en: “Maudgalyāyana, I remember that in the past, when I was practicing bodhisattva conduct, in countless hundreds of thousands of lifetimes I would cut off my flesh and offer it to carnivorous beings.

source: །མཽད་གལ་ངས་མངོན་པར་དྲན་ཏེ། ངས་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཚེ་ཚེ་རབས་བརྒྱ་སྟོང་ཚད་མེད་པ་སྙེད་དུ་ཁྲག་འཐུང་བའི་སེམས་ཅན་རྣམས་ལ་ལུས་ལས་ཁྲག་ཕྱུང་སྟེ་སྦྱིན་པ་ཡོངས་སུ་བཏང་ནས་རབ་ཏུ་ཚིམ་པར་བྱས་སོ།
en: “Maudgalyāyana, I remember that in the past, when I was practicing bodhisattva conduct, in countless hundreds of thousands of lifetimes I would draw blood from my body and offer it to blood-drinking beings to satisfy them.

source: །མཽད་གལ་མདོར་ན་འཇིག་རྟེན་པའི་ནོར་རྫས་སམ་ལོངས་སྤྱད་པར་བྱ་བ་ཅི་ཡང་རུང་སྟེ། སེམས་ཅན་རྣམས་ལ་ནམ་ཡང་ཕངས་ཤིང་སེར་སྣ་བྱས་མ་མྱོང་སྟེ་ཐམས་ཅད་ཀྱང་སེམས་ཅན་རྣམས་ལ་འཚེ་བ་མེད་པ། གནོད་པ་མེད་པ། མཁས་པ་རྣམས་ཀྱིས་གནང་བ། འཕགས་པ་རྣམས་ཀྱིས་རབ་ཏུ་བསྔགས་པར་གྱུར་པ་དེ་ལྟར་ངས་ཡུན་རིང་པོར་བརྟགས་ཏེ་སེམས་ཅན་རྣམས་ལ་སྙིང་རྗེ་བའི་བསམ་པ་རབ་ཏུ་བསྐྱེད་ནས་བཏང་ངོ་།
en: “Maudgalyāyana, in short, when it comes to worldly wealth and belongings, I never experienced any sense of reservation or miserliness while giving them to sentient beings. After careful investigation to ensure that those offerings would not hurt or harm anyone and that they were sanctioned by the wise ones and praised by noble beings, I would offer those things to sentient beings with a compassionate attitude.
